## Question: Pandas â€” 5 Questions

Q6. Load the employees.csv file into a Pandas DataFrame. Display the first 5 rows, and check basic info using info() and summary statistics using describe().

Q7. Display only the id, age, and salary columns. Then show the last 3 rows using tail().

Q8. Filter the DataFrame to show only employees who work in the IT department. Print the result and show the total number of IT employees.

Q9. Sort the DataFrame by salary in descending order and display the top 3 highest-paid employees along with their department and age.

Q10. Replace all salary values greater than 80000 with 80000 using loc. Then calculate and print the new average salary of all employees after replacement.

In [1]:
import numpy as np
import pandas as pd

np.random.seed(42)

ids = np.arange(1, 11)
ages = np.random.randint(18, 60, 10)
salaries = np.random.randint(30000, 90000, 10)
departments = np.array(["HR", "IT", "Finance", "IT", "HR", "Sales", "Finance", "IT", "Sales", "HR"])

DF = pd.DataFrame({
"id": ids,
"age": ages,
"salary": salaries,
"dept": departments
})

DF.to_csv("employees.csv", index=False)
print("Sample Data Created and Saved as employees.csv")

Sample Data Created and Saved as employees.csv

In [32]:
# load the file

DF = pd.read_csv("employees.csv")

DF

   id  age  salary     dept
0   1   56   77191       HR
1   2   46   74131       IT
2   3   32   46023  Finance
3   4   25   71090       IT
4   5   38   31685       HR
5   6   56   30769    Sales
6   7   36   89735  Finance
7   8   40   86101       IT
8   9   28   32433    Sales
9  10   28   35311       HR

In [33]:
DF.head()

   id  age  salary     dept
0   1   56   77191       HR
1   2   46   74131       IT
2   3   32   46023  Finance
3   4   25   71090       IT
4   5   38   31685       HR

In [ ]:
#### Q6. Load the employees.csv file into a Pandas DataFrame. Display the first 5 rows, and check basic info using info() and summary statistics using describe().

# Display first 5 rows
DF.head(5)

   id  age  salary     dept
0   1   56   77191       HR
1   2   46   74131       IT
2   3   32   46023  Finance
3   4   25   71090       IT
4   5   38   31685       HR

In [35]:
# Basic Information 
print("\nInfo method: \n")

print(DF.info())

Info method:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10 non-null     int64
 1   age     10 non-null     int64
 2   salary  10 non-null     int64
 3   dept    10 non-null     object
dtypes: int64(3), object(1)
memory usage: 452.0+ bytes
None

In [36]:
# Summary statistics 
print("\nDescribe method: \n")

print(DF.describe())

Describe method:

             id       age        salary
count  10.00000  10.00000     10.000000
mean    5.50000  38.50000  57446.900000
std     3.02765  11.16791  24357.262884
min     1.00000  25.00000  30769.000000
25%     3.25000  29.00000  33152.500000
50%     5.50000  37.00000  58556.500000
75%     7.75000  44.50000  76426.000000
max    10.00000  56.00000  89735.000000

In [60]:
DF.head(2)

   id  age  salary dept
0   1   56   77191   HR
1   2   46   74131   IT

In [ ]:
#### Q7. Display only the id, age, and salary columns. Then show the last 3 rows using tail().

new_df = DF.loc[:, ["id", "age", "salary"]]

# new_df = DF[["id", "age", "salary"]]

new_df

   id  age  salary
0   1   56   77191
1   2   46   74131
2   3   32   46023
3   4   25   71090
4   5   38   31685
5   6   56   30769
6   7   36   80000
7   8   40   80000
8   9   28   32433
9  10   28   35311

In [38]:
# last 3 rows
new_df.tail(3)

   id  age  salary
7   8   40   86101
8   9   28   32433
9  10   28   35311

In [ ]:
#### Q8. Filter the DataFrame to show only employees who work in the IT department. Print the result and show the total number of IT employees.

new_df = DF.loc[DF["dept"] == "IT"]

new_df

   id  age  salary dept
1   2   46   74131   IT
3   4   25   71090   IT
7   8   40   86101   IT

In [46]:
# Total number of IT Employees

# total = 0

# for i in DF["dept"]:
#     if i == "IT":
#         total += 1

# print(f"Total number of IT employees: {total}")

new_df.shape[0]

10

In [15]:
# new_df = DF.loc[DF["dept"] == "IT"].sum()
# new_df

id            14
age          111
salary    231322
dept      ITITIT
dtype: object

In [65]:
DF.head(2)

   id  age  salary dept
0   1   56   77191   HR
1   2   46   74131   IT

In [ ]:
#### Q9. Sort the DataFrame by salary in descending order and display the top 3 highest-paid employees along with their department and age.

df = DF.sort_values(["salary"], ascending = 0).head(3)

df

   id  age  salary     dept
6   7   36   89735  Finance
7   8   40   86101       IT
0   1   56   77191       HR

In [40]:
df = df.loc[:,["dept", "age"]]
df

      dept  age
6  Finance   36
7       IT   40
0       HR   56

In [ ]:
#### Q10. Replace all salary values greater than 80000 with 80000 using loc. Then calculate and print the new average salary of all employees after replacement.

# DF.head()

# replace_salary = DF.loc[
#     DF["salary"] > 80000
# ]

# replace_salary["salary"] = 80000

# # avg_salary = replace_salary["salary"].mean()

# # print("Avg salary :", avg_salary)

# replace_salary

Empty DataFrame
Columns: [id, age, salary, dept]
Index: []

In [23]:
DF

   id  age  salary     dept
0   1   56   77191       HR
1   2   46   74131       IT
2   3   32   46023  Finance
3   4   25   71090       IT
4   5   38   31685       HR
5   6   56   30769    Sales
6   7   36   89735  Finance
7   8   40   86101       IT
8   9   28   32433    Sales
9  10   28   35311       HR

In [41]:
# Q10. Replace all salary values greater than 80000 with 80000 using loc. Then calculate and print the new average salary of all employees after replacement.

DF.loc[
    DF["salary"] > 80000, "salary"] = 80000

avg_salary = DF["salary"].mean()

print("Average salary: ", avg_salary)

Average salary:  55863.3